In [1]:
import pandas as pd

In [2]:
# store the info of one person
person = {
      'first':'Shorouk',
      'last' :'ELSayed',
      'email':'shoroukelsayed@gmail.com'
}

In [3]:
# store the info of multi person
people = {
      'first':['Shorouk','Sohaila','Reham','Daii'],
      'last' :['ELSayed','Mohamed','Saber','Osama'],
      'email':['shoroukelsayed@gmail.com','sohailamohamed@gmail.com','rehamsaber@gmail.com','daiiosama@gmail.com']
}

In [4]:
people['email']

['shoroukelsayed@gmail.com',
 'sohailamohamed@gmail.com',
 'rehamsaber@gmail.com',
 'daiiosama@gmail.com']

In [5]:
df = pd.DataFrame(people)

In [6]:
df

     first     last                     email
0  Shorouk  ELSayed  shoroukelsayed@gmail.com
1  Sohaila  Mohamed  sohailamohamed@gmail.com
2    Reham    Saber      rehamsaber@gmail.com
3     Daii    Osama       daiiosama@gmail.com

# Ways to Select from Data Frame

In [7]:
# select single column
df['email']

0    shoroukelsayed@gmail.com
1    sohailamohamed@gmail.com
2        rehamsaber@gmail.com
3         daiiosama@gmail.com
Name: email, dtype: object

In [8]:
df['first']

0    Shorouk
1    Sohaila
2      Reham
3       Daii
Name: first, dtype: object

In [9]:
type(df['email'])

pandas.core.series.Series

In [10]:
# another way to select one column by dot notation but here there is an error with column name that have space
df.email

0    shoroukelsayed@gmail.com
1    sohailamohamed@gmail.com
2        rehamsaber@gmail.com
3         daiiosama@gmail.com
Name: email, dtype: object

In [11]:
# select multi columns  
df[['last','email']]

      last                     email
0  ELSayed  shoroukelsayed@gmail.com
1  Mohamed  sohailamohamed@gmail.com
2    Saber      rehamsaber@gmail.com
3    Osama       daiiosama@gmail.com

In [12]:
df[['first','last']]

     first     last
0  Shorouk  ELSayed
1  Sohaila  Mohamed
2    Reham    Saber
3     Daii    Osama

In [13]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [14]:
# can use iloc to select columns and row 
# iloc accept only index

#access to the first row
df.iloc[0]

first                     Shorouk
last                      ELSayed
email    shoroukelsayed@gmail.com
Name: 0, dtype: object

In [15]:
#select all data
df.iloc[:,:]

     first     last                     email
0  Shorouk  ELSayed  shoroukelsayed@gmail.com
1  Sohaila  Mohamed  sohailamohamed@gmail.com
2    Reham    Saber      rehamsaber@gmail.com
3     Daii    Osama       daiiosama@gmail.com

In [16]:
# select all columns except last columns
df.iloc[:,:-1]

     first     last
0  Shorouk  ELSayed
1  Sohaila  Mohamed
2    Reham    Saber
3     Daii    Osama

In [17]:
#select the last column
df.iloc[:,-1]

0    shoroukelsayed@gmail.com
1    sohailamohamed@gmail.com
2        rehamsaber@gmail.com
3         daiiosama@gmail.com
Name: email, dtype: object

In [18]:
#select all data expected last row
df.iloc[:-1,:]

     first     last                     email
0  Shorouk  ELSayed  shoroukelsayed@gmail.com
1  Sohaila  Mohamed  sohailamohamed@gmail.com
2    Reham    Saber      rehamsaber@gmail.com

In [19]:
#select first 2 rows
df.iloc[:2,:]

     first     last                     email
0  Shorouk  ELSayed  shoroukelsayed@gmail.com
1  Sohaila  Mohamed  sohailamohamed@gmail.com

In [20]:
#select last 2 rows
df.iloc[-2:,:]

   first   last                 email
2  Reham  Saber  rehamsaber@gmail.com
3   Daii  Osama   daiiosama@gmail.com

In [21]:
#select last 2 columns
df.iloc[:,-2:]

      last                     email
0  ELSayed  shoroukelsayed@gmail.com
1  Mohamed  sohailamohamed@gmail.com
2    Saber      rehamsaber@gmail.com
3    Osama       daiiosama@gmail.com

In [22]:
#select first 2 rows
df.iloc[[0,1]]

     first     last                     email
0  Shorouk  ELSayed  shoroukelsayed@gmail.com
1  Sohaila  Mohamed  sohailamohamed@gmail.com

In [23]:
#select first 2 rows by use loc
df.loc[[0,1]]

     first     last                     email
0  Shorouk  ELSayed  shoroukelsayed@gmail.com
1  Sohaila  Mohamed  sohailamohamed@gmail.com

In [24]:
#access to the rows and columns
df.iloc[[0,1],2]

0    shoroukelsayed@gmail.com
1    sohailamohamed@gmail.com
Name: email, dtype: object

In [25]:
# can use loc to select columns and row 
# loc accept only name of colums 

# select columns that name is first
df.loc[:, 'first']

0    Shorouk
1    Sohaila
2      Reham
3       Daii
Name: first, dtype: object

In [26]:
#select more than one columns
df.loc[:,'first':'email']

     first     last                     email
0  Shorouk  ELSayed  shoroukelsayed@gmail.com
1  Sohaila  Mohamed  sohailamohamed@gmail.com
2    Reham    Saber      rehamsaber@gmail.com
3     Daii    Osama       daiiosama@gmail.com

In [27]:
#select 2 rows
df.loc[[0,1],'email']

0    shoroukelsayed@gmail.com
1    sohailamohamed@gmail.com
Name: email, dtype: object

In [28]:
#select 2 columns
df.loc[[0,1],['last','email']]

      last                     email
0  ELSayed  shoroukelsayed@gmail.com
1  Mohamed  sohailamohamed@gmail.com

# Index of Data Frame

In [29]:
df.set_index('email',inplace=True)

In [30]:
df

                            first     last
email
shoroukelsayed@gmail.com  Shorouk  ELSayed
sohailamohamed@gmail.com  Sohaila  Mohamed
rehamsaber@gmail.com        Reham    Saber
daiiosama@gmail.com          Daii    Osama

In [31]:
df.index

Index(['shoroukelsayed@gmail.com', 'sohailamohamed@gmail.com',
       'rehamsaber@gmail.com', 'daiiosama@gmail.com'],
      dtype='object', name='email')

In [32]:
df.loc['shoroukelsayed@gmail.com']

first    Shorouk
last     ELSayed
Name: shoroukelsayed@gmail.com, dtype: object

In [33]:
df.loc['shoroukelsayed@gmail.com','last']

'ELSayed'

In [34]:
df.reset_index(inplace=True)

In [35]:
df

                      email    first     last
0  shoroukelsayed@gmail.com  Shorouk  ELSayed
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

#  Select a row with a condition

In [36]:
df[df['last'] == 'ELSayed']

                      email    first     last
0  shoroukelsayed@gmail.com  Shorouk  ELSayed

In [37]:
df[(df['first'] == 'Shorouk') | (df['first'] == 'Sohaila')]

                      email    first     last
0  shoroukelsayed@gmail.com  Shorouk  ELSayed
1  sohailamohamed@gmail.com  Sohaila  Mohamed

In [38]:
df[df['last']=='Osama']

                 email first   last
3  daiiosama@gmail.com  Daii  Osama

In [39]:
df[~(df['email'] == 'shoroukelsayed@gmail.com')]

                      email    first     last
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

In [40]:
df

                      email    first     last
0  shoroukelsayed@gmail.com  Shorouk  ELSayed
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

# Columns name

In [41]:
# disply all colnmns names
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [42]:
# rename all columns names
df.columns = ['email', 'first_name', 'last_name']

In [43]:
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [44]:
df

                      email first_name last_name
0  shoroukelsayed@gmail.com    Shorouk   ELSayed
1  sohailamohamed@gmail.com    Sohaila   Mohamed
2      rehamsaber@gmail.com      Reham     Saber
3       daiiosama@gmail.com       Daii     Osama

In [45]:
# make all columns name upper case
df.columns = [x.upper() for x in df.columns]

In [46]:
df

                      EMAIL FIRST_NAME LAST_NAME
0  shoroukelsayed@gmail.com    Shorouk   ELSayed
1  sohailamohamed@gmail.com    Sohaila   Mohamed
2      rehamsaber@gmail.com      Reham     Saber
3       daiiosama@gmail.com       Daii     Osama

In [47]:
# use rename method to rename specific column
df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME': 'last'}, inplace=True)

In [48]:
df

                      EMAIL    first     last
0  shoroukelsayed@gmail.com  Shorouk  ELSayed
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

# Update existing rows and columns

In [49]:
# here we update row od index 0

df.loc[0] = ['shames@gmail.com', 'shames', 'elsayed']

In [50]:
df

                      EMAIL    first     last
0          shames@gmail.com   shames  elsayed
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

In [51]:
# here we update one row in two columns "first and email" only
df.loc[0, ['first', 'EMAIL']] = ['Shorouk', 'shoroukelsayed@gmail.com']

In [52]:
df

                      EMAIL    first     last
0  shoroukelsayed@gmail.com  Shorouk  elsayed
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

In [53]:
# make all columns name lower case
df.columns = [x.lower() for x in df.columns]

In [54]:
df

                      email    first     last
0  shoroukelsayed@gmail.com  Shorouk  elsayed
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

In [55]:
#rename one column "last"
df.loc[0, ['last']] = 'Hassan'

In [56]:
df

                      email    first     last
0  shoroukelsayed@gmail.com  Shorouk   Hassan
1  sohailamohamed@gmail.com  Sohaila  Mohamed
2      rehamsaber@gmail.com    Reham    Saber
3       daiiosama@gmail.com     Daii    Osama

In [57]:
df.at[3, 'last'] = 'Abd_ELrahman'

In [58]:
df

                      email    first          last
0  shoroukelsayed@gmail.com  Shorouk        Hassan
1  sohailamohamed@gmail.com  Sohaila       Mohamed
2      rehamsaber@gmail.com    Reham         Saber
3       daiiosama@gmail.com     Daii  Abd_ELrahman

In [59]:
filt = (df['email'] == 'daiiosama@gmail.com' )

In [60]:
filt

0    False
1    False
2    False
3     True
Name: email, dtype: bool

In [61]:
df['email'] = df['email'].str.capitalize()

In [62]:
df

                      email    first          last
0  Shoroukelsayed@gmail.com  Shorouk        Hassan
1  Sohailamohamed@gmail.com  Sohaila       Mohamed
2      Rehamsaber@gmail.com    Reham         Saber
3       Daiiosama@gmail.com     Daii  Abd_ELrahman

# Apply Function

In [63]:
# apply func work only on series
df['email'].apply(len)

0    24
1    24
2    20
3    19
Name: email, dtype: int64

In [64]:
def update_email(email):
    return email.lower()

In [65]:
df['email'].apply(update_email)

0    shoroukelsayed@gmail.com
1    sohailamohamed@gmail.com
2        rehamsaber@gmail.com
3         daiiosama@gmail.com
Name: email, dtype: object

In [66]:
df

                      email    first          last
0  Shoroukelsayed@gmail.com  Shorouk        Hassan
1  Sohailamohamed@gmail.com  Sohaila       Mohamed
2      Rehamsaber@gmail.com    Reham         Saber
3       Daiiosama@gmail.com     Daii  Abd_ELrahman

In [67]:
df['email'] = df['email'].apply(update_email)

In [68]:
df

                      email    first          last
0  shoroukelsayed@gmail.com  Shorouk        Hassan
1  sohailamohamed@gmail.com  Sohaila       Mohamed
2      rehamsaber@gmail.com    Reham         Saber
3       daiiosama@gmail.com     Daii  Abd_ELrahman

In [69]:
def update_first(first):
    return first.lower()

In [70]:
df['first'].apply(update_first)

0    shorouk
1    sohaila
2      reham
3       daii
Name: first, dtype: object

In [71]:
df

                      email    first          last
0  shoroukelsayed@gmail.com  Shorouk        Hassan
1  sohailamohamed@gmail.com  Sohaila       Mohamed
2      rehamsaber@gmail.com    Reham         Saber
3       daiiosama@gmail.com     Daii  Abd_ELrahman

In [72]:
df['first'] = df['first'].apply(update_first)

In [73]:
df

                      email    first          last
0  shoroukelsayed@gmail.com  shorouk        Hassan
1  sohailamohamed@gmail.com  sohaila       Mohamed
2      rehamsaber@gmail.com    reham         Saber
3       daiiosama@gmail.com     daii  Abd_ELrahman

In [74]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [75]:
df

                      email    first          last
0  shoroukelsayed@gmail.com  shorouk        Hassan
1  sohailamohamed@gmail.com  sohaila       Mohamed
2      rehamsaber@gmail.com    reham         Saber
3       daiiosama@gmail.com     daii  Abd_ELrahman

In [76]:
df.apply(len)

email    4
first    4
last     4
dtype: int64

In [77]:
len(df['email'])

4

In [78]:
df.apply(pd.Series.min)

email    daiiosama@gmail.com
first                   daii
last            Abd_ELrahman
dtype: object

In [79]:
df.apply(lambda x: x.min())

email    daiiosama@gmail.com
first                   daii
last            Abd_ELrahman
dtype: object

# Applymap Function

In [80]:
# applymap work only on dateframe
df.applymap(len)

   email  first  last
0     24      7     6
1     24      7     7
2     20      5     5
3     19      4    12

In [81]:
df.applymap(str.capitalize)

                      email    first          last
0  Shoroukelsayed@gmail.com  Shorouk        Hassan
1  Sohailamohamed@gmail.com  Sohaila       Mohamed
2      Rehamsaber@gmail.com    Reham         Saber
3       Daiiosama@gmail.com     Daii  Abd_elrahman

In [82]:
df

                      email    first          last
0  shoroukelsayed@gmail.com  shorouk        Hassan
1  sohailamohamed@gmail.com  sohaila       Mohamed
2      rehamsaber@gmail.com    reham         Saber
3       daiiosama@gmail.com     daii  Abd_ELrahman

# Map Function

In [83]:
# map func work only on series
df['first'].map({'shorouk': 'shames', 'sohaila': "salma"})

0    shames
1     salma
2       NaN
3       NaN
Name: first, dtype: object

In [84]:
#can use replace instead of map to can out nan cells
df['first'].replace({'shorouk': 'shames', 'sohaila': "salma"})

0    shames
1     salma
2     reham
3      daii
Name: first, dtype: object

In [85]:
df

                      email    first          last
0  shoroukelsayed@gmail.com  shorouk        Hassan
1  sohailamohamed@gmail.com  sohaila       Mohamed
2      rehamsaber@gmail.com    reham         Saber
3       daiiosama@gmail.com     daii  Abd_ELrahman

In [86]:
# merge the first and second names
df['full_name'] = df['first'] + ' ' + df['last']

In [87]:
df

                      email    first          last          full_name
0  shoroukelsayed@gmail.com  shorouk        Hassan     shorouk Hassan
1  sohailamohamed@gmail.com  sohaila       Mohamed    sohaila Mohamed
2      rehamsaber@gmail.com    reham         Saber        reham Saber
3       daiiosama@gmail.com     daii  Abd_ELrahman  daii Abd_ELrahman

# Delete columns

In [88]:
df.drop(columns=['first', 'last'], inplace=True)

In [89]:
df

                      email          full_name
0  shoroukelsayed@gmail.com     shorouk Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed
2      rehamsaber@gmail.com        reham Saber
3       daiiosama@gmail.com  daii Abd_ELrahman

In [90]:
# can get first name last name from full name by split function
df['full_name'].str.split(' ', expand=True)

         0             1
0  shorouk        Hassan
1  sohaila       Mohamed
2    reham         Saber
3     daii  Abd_ELrahman

In [91]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [92]:
df

                      email          full_name    first          last
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman

# Append rows

In [93]:
df.append({'first': 'rawan','last':'mohamed'}, ignore_index=True)

C:\Users\shoro\AppData\Local\Temp\ipykernel_15856\2802075798.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'rawan','last':'mohamed'}, ignore_index=True)

                      email          full_name    first          last
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
4                       NaN                NaN    rawan       mohamed

In [94]:
people = {
    'first': ['sara', 'marym'],
    'last': ['Yasser', 'Ahmed'],
    'email' : ['sarayasser@gmail.com', 'marymahmed@gmail.com'],
}

df2 = pd.DataFrame(people)

In [95]:
df2

   first    last                 email
0   sara  Yasser  sarayasser@gmail.com
1  marym   Ahmed  marymahmed@gmail.com

In [96]:
df.append(df2, ignore_index=True, sort=True)

C:\Users\shoro\AppData\Local\Temp\ipykernel_15856\855908984.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=True)

                      email    first          full_name          last
0  shoroukelsayed@gmail.com  shorouk     shorouk Hassan        Hassan
1  sohailamohamed@gmail.com  sohaila    sohaila Mohamed       Mohamed
2      rehamsaber@gmail.com    reham        reham Saber         Saber
3       daiiosama@gmail.com     daii  daii Abd_ELrahman  Abd_ELrahman
4      sarayasser@gmail.com     sara                NaN        Yasser
5      marymahmed@gmail.com    marym                NaN         Ahmed

In [97]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\shoro\AppData\Local\Temp\ipykernel_15856\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [98]:
df

                      email          full_name    first          last
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
4      sarayasser@gmail.com                NaN     sara        Yasser
5      marymahmed@gmail.com                NaN    marym         Ahmed

# Delete row based on index

In [99]:
df.drop(index=4, inplace=True)

In [100]:
df

                      email          full_name    first          last
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
5      marymahmed@gmail.com                NaN    marym         Ahmed

In [101]:
filt = df[df['last'] == 'Ahmed'].index #  get index of user who last name is marym 
df.drop(index= filt) # and delete it

                      email          full_name    first          last
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman

In [102]:
df

                      email          full_name    first          last
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
5      marymahmed@gmail.com                NaN    marym         Ahmed

# Sorting

In [103]:
# sort by last name columns desending
df.sort_values(by='last')

                      email          full_name    first          last
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
5      marymahmed@gmail.com                NaN    marym         Ahmed
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber

In [104]:
df.sort_values(by=['email', 'last'], ascending=True)

                      email          full_name    first          last
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
5      marymahmed@gmail.com                NaN    marym         Ahmed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed

In [105]:
df.sort_values(by=['email', 'last'], ascending=[True, False], inplace=True)

In [106]:
df

                      email          full_name    first          last
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
5      marymahmed@gmail.com                NaN    marym         Ahmed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed

In [107]:
# sort by index not values 
df.sort_index()

                      email          full_name    first          last
0  shoroukelsayed@gmail.com     shorouk Hassan  shorouk        Hassan
1  sohailamohamed@gmail.com    sohaila Mohamed  sohaila       Mohamed
2      rehamsaber@gmail.com        reham Saber    reham         Saber
3       daiiosama@gmail.com  daii Abd_ELrahman     daii  Abd_ELrahman
5      marymahmed@gmail.com                NaN    marym         Ahmed

In [108]:
df['last'].sort_values()

3    Abd_ELrahman
5           Ahmed
0          Hassan
1         Mohamed
2           Saber
Name: last, dtype: object